tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

brew "asdf"
brew "gawk"
brew "git"
brew "gnupg"
brew "mas"
brew "sqlite"
brew "starship"
brew "stow"
brew "tree"

cask "alfred", args: { appdir: "/Applications" }
cask "appcleaner", args: { appdir: "/Applications" }
cask "docker", args: { appdir: "/Applications" }
cask "font-code-new-roman-nerd-font"
cask "karabiner-elements", args: { appdir: "/Applications" }
cask "tableplus", args: { appdir: "/Applications" }
cask "vagrant", args: { appdir: "/Applications" }
cask "virtualbox", args: { appdir: "/Applications" }
cask "visual-studio-code", args: { appdir: "/Applications" }

mas "1Keyboard", id: 766939888
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Autodesk Pixlr", id: 880663569
mas "CalcMadeEasy", id: 417404127
mas "Color Picker", id: 641027709
mas "ColorSnapper", id: 418176775
mas "com.adriangranados.wifiexplorerlite", id: 1408727408
mas "Composure", id: 656377653
mas "Cookbook Themes", id: 787647411
mas "Craft", id: 1487937127
mas "DesiGN for iBooks - Templates", id: 527161787
mas "Disk Diag", id: 672206759
mas "exifpurge", id: 784466108
mas "feedly", id: 865500966
mas "Fotor Photo Editor", id: 503039729
mas "iBooks Author", id: 490152466
mas "iMage Tools", id: 493949693
mas "iMovie", id: 408981434
mas "iText Express", id: 416550249
mas "JPEGmini Lite", id: 525742250
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "MARKETSPEED", id: 946680495
mas "Memory Clean", id: 451444120
mas "NetSpot", id: 514951692
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Pocket", id: 568494494
mas "PopClip", id: 445189367
mas "QaLL", id: 480452005
mas "Skala Preview", id: 498875079
mas "Skitch", id: 425955336
mas "Slack", id: 803453959
mas "StuffIt Expander", id: 405580712
mas "The Unarchiver", id: 425424353
mas "ToyViewer", id: 414298354
mas "Twitter", id: 1482454543
mas "XnSketch", id: 567379804
mas "フリーフォント（商用オープンタイプフォント550種", id: 647697434
mas "宛名職人V24M", id: 1225545286
